# Brewfile — managed by chezmoi
# Source of truth for intended Homebrew state.
# - This file is evaluated as Ruby; use OS.mac? / OS.linux? for platform-specific entries.
# - Do NOT regenerate this file wholesale from `brew bundle dump`.
#   Comments, conditionals, and annotations are hand-maintained.
# - Commented-out lines are intentionally excluded (broken, unwanted, or deferred).

# brew "age-plugin-yubikey"
brew "anomalyco/tap/opencode"
brew "antidote" # zsh plugin manager
brew "bash" unless ENV["HOMEBREW_CODESPACES"]
brew "bat" # better cat
brew "beads" # beads CLI for opencode-beads plugin
brew "blueutil" if OS.mac? # control bluetooth by alfred
brew "btop" unless ENV["HOMEBREW_CODESPACES"] # better top
brew "chezmoi"
brew "colima" unless ENV["HOMEBREW_CODESPACES"]
brew "colordiff" unless ENV["HOMEBREW_CODESPACES"]
brew "docker" unless ENV["HOMEBREW_CODESPACES"]
brew "docker-compose" unless ENV["HOMEBREW_CODESPACES"]
brew "eza" # better ls
brew "fd" unless ENV["HOMEBREW_CODESPACES"] # nvim mason dep
brew "ffmpeg" # dependency for timg
brew "fzf" # fuzzy finder
brew "gh" unless ENV["HOMEBREW_CODESPACES"]
brew "git" unless ENV["HOMEBREW_CODESPACES"]
brew "htop" unless ENV["HOMEBREW_CODESPACES"]
brew "k9s"
brew "kubernetes-cli" unless ENV["HOMEBREW_CODESPACES"]
brew "mas" if OS.mac? # mac app store
brew "mise" # mise-en-place
brew "neovim" unless ENV["HOMEBREW_CODESPACES"]
brew "nmap"
brew "opencode" unless ENV["HOMEBREW_CODESPACES"]
brew "parallel" unless ENV["HOMEBREW_CODESPACES"]
# brew "pinentry-mac" if OS.mac?
# brew "rage" # better age
brew "ripgrep"
brew "sevenzip" unless ENV["HOMEBREW_CODESPACES"]
brew "thefuck" unless ENV["HOMEBREW_CODESPACES"] # fixes typos on previous commands
brew "timg" unless ENV["HOMEBREW_CODESPACES"] # terminal image/video viewer (kitty graphics)
brew "tmux" unless ENV["HOMEBREW_CODESPACES"]
brew "tree"
brew "uv" # python manager
brew "viu" unless ENV["HOMEBREW_CODESPACES"] # terminal image viewer (kitty graphics)
brew "wakatime-cli" unless ENV["HOMEBREW_CODESPACES"]
brew "watch"
brew "wget" unless ENV["HOMEBREW_CODESPACES"]
# brew "ykman"
# brew "ykpers"
brew "zsh" unless ENV["HOMEBREW_CODESPACES"]
cask "1password" if OS.mac? # work
cask "1password-cli" if OS.mac? # work
cask "alfred" if OS.mac? # better spotlight
cask "amethyst" if OS.mac? # tiling wm
cask "claude-code"
cask "cursor" if OS.mac? && ENV["HOMEBREW_PRIVATE"]
# cask "element" if OS.mac? # matrix chat
cask "font-fira-code-nerd-font" if OS.mac?
cask "font-symbols-only-nerd-font" if OS.mac?
cask "ghostty" if OS.mac?
# cask "google-drive" if OS.mac?
# cask "gpg-suite" if OS.mac?
cask "jordanbaird-ice" if OS.mac? # menu bar
# cask "lm-studio" if OS.mac?
cask "lulu" if OS.mac? && ENV["HOMEBREW_PRIVATE"] # firewall
# cask "macwhisper" if OS.mac?
cask "obsidian" if OS.mac?
cask "prismlauncher"
cask "shadow" if OS.mac? && ENV["HOMEBREW_PRIVATE"]
# cask "slack" if OS.mac?
cask "visual-studio-code" if OS.mac?
cask "vscodium"
cask "wakatime" if OS.mac?
cask "xscreensaver" if OS.mac?
# cask "yubico-authenticator" if OS.mac?
cask "zerotier-one"
# cask "zoom" if OS.mac?
mas "Fantastical", id: 975937182 if OS.mac? && $stdin.tty?
mas "Irvue", id: 1039633667 if OS.mac? && $stdin.tty?
tap "anomalyco/tap"
